def divide(first, second):
    if second == 0:
        return '"Ошибка"'
    else:
        return first / second


if __name__ == '__main__':
    print('____________________________________________________________________________________')
    print('test --->  NAME_TEST_FUN', '\n')
    print('START_______________________________________________________________________________')
    print(divide(1515, 15.15))
    # x = 0
    # print(f'Type test    --->    {type(x)}    {x}')
    print('END_________________________________________________________________________________')